// export type Lang = 'en' | 'el';

// export const t = {
//   en: {
//     details: {
//       heading: 'Event Details',
//       transport: 'Transportation by boat will be provided from Dapia to Zogeria Beach.',
//       arriveEarly: 'Please arrive 20–30 minutes early to ensure smooth boarding.',
//       dress: 'Dress code: Summer chic',
//     },
//     dateLocationTime: {
//       timeLabel: 'Time:',
//       locationLabel: 'Location:',
//     },
//   },
//   el: {
//     details: {
//       heading: 'Λεπτομέρειες Εκδήλωσης',
//       transport: 'Θα παρέχεται μεταφορά με βάρκες από τη Ντάπια προς τη Ζωγεριά.',
//       arriveEarly: 'Παρακαλούμε φτάστε 20–30 λεπτά νωρίτερα για άνετη επιβίβαση.',
//       dress: 'Ενδυματολογικός κώδικας: Καλοκαιρινό κομψό',
//       travelHeader1: 'Από την Αθήνα στο νησί των Σπετσών (Λιμάνι Ντάπιας)',
//       travelOption1: 'Με πλοίο (περίπου 2 ώρες): Μπορείτε να πάρετε απευθείας το πλοίο από το λιμάνι του Πειραιά προς τις Σπέτσες (Λιμάνι Ντάπιας).',
//       travelOption2: 'Με αυτοκίνητο (περίπου 3,5 ώρες): Οδηγήστε από την Αθήνα μέχρι το λιμάνι της Κόστας. Θα βρείτε δύο χώρους στάθμευσης ακριβώς δίπλα στο λιμάνι, όπου μπορείτε να αφήσετε το αυτοκίνητό σας με ασφάλεια. Από εκεί συνεχίζετε προς τις Σπέτσες (Λιμάνι Ντάπιας) με θαλάσσιο ταξί ή ferry (ελέγξτε το δρομολόγιο των ferry).',
//       dressCode1: '<strong>Beach Formal Attire</strong> – Κομψή ένδυση προσαρμοσμένη στο παραθαλάσσιο περιβάλλον. Για μεγαλύτερη άνεση στην άμμο και στο παραθαλάσσιο μονοπάτι, προτιμήστε flat παπούτσια ή χαμηλά τακούνια· τα ψηλοτάκουνα και τα stiletto δεν είναι κατάλληλα.',
//       dressCode2: 'Το βράδυ μπορεί να δροσίσει, οπότε ένα σάλι ή εσάρπα (για τις γυναίκες) και ένα ελαφρύ σακάκι (για τους άνδρες) θα φανούν χρήσιμα.',
//       toWeddingLocation1: 'Παραδοσιακά καραβάκια θα μεταφέρουν τους καλεσμένους από το λιμάνι των Σπετσών (Ντάπια) στην παραλία της Ζωγεριάς.',
//       toWeddingLocation2: 'Παρακαλούμε φροντίστε να βρίσκεστε στο σημείο επιβίβασης 15–20 λεπτά πριν την αναχώρηση.',
//       departure1: 'Αναχώρηση: 17:15',
//       return1: 'Επιστροφή: Καθ’ όλη τη διάρκεια της νύχτας θα υπάρχουν θαλάσσια μέσα για την επιστροφή στο λιμάνι της Ντάπιας',
//       returnOptionsLabel: 'Εναλλακτικοί τρόποι πρόσβασης στην παραλία της Ζωγεριάς:',
//       returnOption1: '•	<strong>Με θαλάσσιο ταξί:</strong> Μεταβείτε στο λιμάνι Ντάπια και επιβιβαστείτε στο επόμενο διαθέσιμο θαλάσσιο ταξί.',
//       returnOption2: '•	<strong>Με μηχανάκι ή scooter:</strong> Οδηγήστε έως την παραλία Ζωγεριά (όπου θα γίνει η δεξίωση) και συνεχίστε με περπάτημα περίπου 7 λεπτών στο μονοπάτι προς την εκκλησία του Αγίου Γεωργίου.',
//       whereToStayText: 'Οι Σπέτσες προσφέρουν μια υπέροχη ποικιλία επιλογών διαμονής, από ξενοδοχεία δίπλα στη θάλασσα έως παραδοσιακούς ξενώνες κρυμμένους στα γραφικά σοκάκια του νησιού. Έχουμε επιλέξει μερικές προτάσεις για τους καλεσμένους μας και, αναφέροντας τον γάμο μας κατά την κράτηση, ενδέχεται να εξασφαλίσετε καλύτερες τιμές.',
//       whereToStayFooter: '*Αστέρια κατάταξης <br/> Η απόσταση που αναγράφεται είναι από το λιμάνι της Ντάπιας',
//       gettingAroundSpetsesText: 'Στις Σπέτσες δεν κυκλοφορούν αυτοκίνητα, οπότε η μετακίνηση μπορεί να γίνει με τα πόδια, ποδήλατο, μηχανάκι, γουρούνα ή ακόμα και με άμαξα. Αν θέλετε να νοικιάσετε μηχανάκι ή γουρούνα, υπάρχουν πολλές εταιρείες ενοικίασης στο νησί. Παρακάτω προτείνουμε μερικές:',
//     },
//     dateLocationTime: {
//       timeLabel: 'Ώρα:',
//       locationLabel: 'Τοποθεσία:',
//       location: 'Το μυστήριο θα πραγματοποιηθεί στο εκκλησάκι του Αγίου Γεωργίου στη παραλία της Ζωγεριάς.',
//       partyLocation: 'Η δεξίωση θα ακολουθήσει στην παραλία της μικρής Ζωγεριάς.'
//     },
//     qAndA: {
//       question1Label: 'Ποια είναι η προθεσμία για RSVP;',
//       question2Label: 'Επιτρέπονται τα παιδιά;',
//       question3Label: 'Τι παπούτσια πρέπει/δεν πρέπει να φορέσω;',
//       question4Label: 'Τι να κάνω αν χάσω το καραβάκι για την τελετή;',
//       question5Label: 'Μπορώ να φέρω συνοδό;',
//       question6Label: 'Με ποιον μπορώ να επικοινωνήσω για ερωτήσεις;',
//       question1Answer: 'Όσο πιο σύντομα μπορέσετε να μας ενημερώσετε, τόσο καλύτερα – θα μας βοηθήσει πολύ στην οργάνωση.',
//       question2Answer: 'Σας ενημερώνουμε με σεβασμό ότι ο γάμος μας θα είναι μόνο για ενήλικες.',
//       question3Answer: 'Καθώς ο γάμος μας θα γίνει στην παραλία, με κάποια τμήματα με άμμο και ελαφρώς βραχώδη μονοπάτια, προτείνουμε άνετα παπούτσια. Ιδανικά είναι τα flat ή τα χαμηλά τακούνια, ενώ τα stiletto και τα ψηλοτάκουνα δεν είναι κατάλληλα για τον χώρο.',
//       question4Answer: 'Μην ανησυχείτε! Μπορείτε να φτάσετε στην παραλία της Ζωγεριάς με δύο τρόπους:',
//       question4Answer1: '•	Με θαλάσσιο ταξί (περίπου 15 λεπτά): Από το λιμάνι της Ντάπιας κατευθείαν προς την παραλία της Ζωγεριάς.',
//       question4Answer2: '•	Με μηχανάκι ή γουρούνα (περίπου 15 λεπτά): Οδηγήστε έως την παραλία της Ζωγεριά; (όπου θα γίνει η δεξίωση) και συνεχίστε με περπάτημα περίπου 7 λεπτών στο μονοπάτι προς την εκκλησία του Αγίου Γεωργίου.',
//       question5Answer: 'Ανυπομονούμε να γιορτάσουμε μαζί σας! Ωστόσο, αυτή τη στιγμή μπορούμε να φιλοξενήσουμε μόνο τα άτομα που αναφέρονται στην πρόσκληση. Αν έχετε οποιαδήποτε απορία ή ιδιαίτερη περίπτωση, μη διστάσετε να επικοινωνήσετε μαζί μας.',
//       question6Answer: 'Μπορείτε να απευθυνθείτε σε εμάς οποιαδήποτε στιγμή, θα χαρούμε πολύ να σας βοηθήσουμε σε ό,τι χρειαστείτε.',
//       question6Answer1: 'Αριστοτέλης: +30 6984603110',
//       question6Answer2: 'Ελισάβετ: +30 6977370374',
//       question6Answer3: 'Χριστίνα (η planner μας): +30 6945414465',
//     }
//   },
// }

// export function getLang(input?: string): Lang {
//   const v = (input ?? '').toLowerCase();
//   return v === 'el' ? 'el' : 'en';
// }